from  flask import Flask
answer1=input("Кои са основните клетъчни органели, отговорни за производството на енергия в клетката? ")
if answer1 == "Митохондрии":
    print("Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'Митохондрии'")

answer2=input("Как се нарича процесът, при който растенията набавят хранителните си вещества? ")
if answer2 == "Фотосинтеза":
    print("Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'Фотосинтеза'")

answer3=input("Какво представлява ДНК? ")
if answer3 == "Киселина, носител на генетичната информация":
    print("Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'Киселина, носител на генетичната информация'")

answer4=input("Коя е тъканта, която покрива повърхността на тялото и вътрешните повърхности на органите в животните? ")
if answer4 == "Епителна тъкан" :
    print("Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'Епителна тъкан'")

answer5=input("Как се нарича процесът на разделение на клетката, при който се образуват две клетки-дъщери с еднакъв генетичен материал? ")
if answer5 == "Митоза":
    print("Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'Митоза'")

answer6=input("Кой е най-големият орган в човешкото тяло? ")
if answer6 == "Кожата":
    print("Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'Кожата'")

answer7=input("Какво е хлорофилът? ")
if answer7 == "Зелен пигмент в растенията":
    print("Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'Зелен пигмент в растенията'")

answer8=input("Как се нарича процесът, при който организмите използват кислорода, за да освободят енергия от храната? ")
if answer8 == "Дишане":
    print("Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'Дишане'")

answer9=input("Каква е основната функция на цитоплазмата в клетката? ")
if answer9 == "Обгражда клетъчните органели и помага за транспорта на вещества в клетката":
    print("Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'Обгражда клетъчните органели и помага за транспорта на вещества в клетката'")

answer10=input("Колко е дълго тънкото черво? ")
if answer10 == "280см":
    print("Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е '280см'")