from  flask import Flask
answer1=input("Кой е авторът на романа Под игото? ")
if answer1 == "Иван Вазов":
    print("Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'Иван Вазов'")

answer2=input("Кое е първото издание на Чичовци на Йордан Йовков? ")
if answer2 == "1933 година":
    print("Верен отговор! ")
else:
    print(" Грешен отговор! Отговорът е '1933 година'")

answer3=input("Как се казва авторът на Тютюн? ")
if answer3 == "Димитър Димов":
    print(" Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'Димитър Димов'")

answer4=input("Кой е създателът на романа Бай Ганьо? ")
if answer4 == "Алеко Константинов" :
    print(" Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'Алеко Константинов'")

answer5=input("Коя е първата поетеса в българската литература, чиито произведения са запазени до днес? ")
if answer5 == "Мара Белчева":
    print(" Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'Мара Белчева'")

answer6=input("Кой е псевдонимът на Иван Богоров? ")
if answer6 == "Елин Пелин":
    print(" Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'Елин Пелин'")

answer7=input("Кой български писател е известен с творбите си Вяра и отчаяние, Хайка за вълци и Дневникът на един доброволец? ")
if answer7 == "Димитър Димов":
    print(" Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'Димитър Димов7'")

answer8=input("Как се казва първата българска жена-писателка, автор на романа Под манастирската лоза? ")
if answer8 == "Екатерина Каравелова":
    print(" Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'Екатерина Каравелова'")

answer9=input("Кой е авторът на драмата Иванко? ")
if answer9 == "Петко Славейков":
    print(" Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'Петко Славейков'")

answer10=input("Кой български писател е автор на романите Историята на един убиец и Белата книга? ")
if answer10 == "Тзветан Тодоров":
    print(" Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'Тзветан Тодоров'")