from  flask import Flask
answer1=input("Коя е основната единица за измерване на количеството вещество в химията ? ")
if answer1 == "Мол":
    print("Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'Мол'")

answer2=input("Какъв тип връзка се образува между атомите при споделяне на електрони? ")
if answer2 == "Ковалентна връзка" or "Ковалентна":
    print("Верен отговор! ")
else:
    print(" Грешен отговор! Отговорът е 'Ковалентна връзка'")

answer3=input("Коя е най-леката елементна частица? ")
if answer3 == "Електрон":
    print(" Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'Електрон'")

answer4=input("Как се нарича процесът на преминаване на газ в течност? ")
if answer4 == "Кондензация" :
    print(" Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'Кондензация'")

answer5=input("Каква е химичната формула на вода? ")
if answer5 == "H2O":
    print(" Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'H2O'")

answer6=input("Как се нарича процесът на разграфяване на слънчевата светлина от прозорец? ")
if answer6 == "Дисперсия":
    print(" Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'Дисперсия'")

answer7=input("Как се нарича вещество, което ускорява химична реакция, но не се консумира в процеса? ")
if answer7 == "Катализатор":
    print(" Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'Катализатор'")

answer8=input("Коя е основната киселина в лимоните? ")
if answer8 == "Лимонена киселина":
    print(" Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'Лимонена киселина'")
answer9=input("Как се нарича процесът на отделяне на светлина от вещество след удар от външен източник? ")
if answer9 == "Флуоресценция":
    print(" Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'Флуоресценция'")

answer10=input("Коя е химичната формула на сода бикарбонат? ")
if answer10 == "NaHCO3":
    print(" Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'NaHCO3'")