from  flask import Flask
answer1=input("Коя е основната единица за измерване на количеството вещество в химията ? ")
if answer1 == "Мол":
    print("Correct!")
else:
    print(" Отговорът е 'Мол', не")

answer2=input("Какъв тип връзка се образува между атомите при споделяне на електрони? ")
if answer2 == "Ковалентна връзка" or "Ковалентна":
    print("Correct!")
else:
    print(" Отговорът е 'Ковалентна връзка', не")

answer3=input("Коя е най-леката елементна частица? ")
if answer3 == "Електрон":
    print("Correct!")
else:
    print(" Отговорът е 'Електрон', не")

answer4=input("Как се нарича процесът на преминаване на газ в течност? ")
if answer4 == "Кондензация" :
    print("Correct!")
else:
    print(" Отговорът е 'Кондензация', не")

answer5=input("Каква е химичната формула на вода? ")
if answer5 == "H2O":
    print("Correct!")
else:
    print(" Отговорът е 'H2O', не {answer5!r}")

answer6=input("Как се нарича процесът на разграфяване на слънчевата светлина от прозорец? ")
if answer6 == "Дисперсия":
    print("Correct!")
else:
    print(" Отговорът е 'Дисперсия', не")

answer7=input("Как се нарича вещество, което ускорява химична реакция, но не се консумира в процеса? ")
if answer7 == "Катализатор":
    print("Correct!")
else:
    print(" Отговорът е 'Катализатор', не")

answer8=input("Коя е основната киселина в лимоните? ")
if answer8 == "Лимонена киселина":
    print("Correct!")
else:
    print(" Отговорът е 'Лимонена киселина', не")
answer9=input("Как се нарича процесът на отделяне на светлина от вещество след удар от външен източник? ")
if answer9 == "Флуоресценция":
    print("Correct!")
else:
    print(" Отговорът е 'Мол', не")

answer10=input("Коя е химичната формула на сода бикарбонат? ")
if answer10 == "NaHCO3":
    print("Correct!")
else:
    print(" Отговорът е 'NaHCO3', не")