from  flask import Flask
answer1=input("Коя е най-голямата континентална държава в света? ")
if answer1 == "Русия":
    print("Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'Русия'")

answer2=input("Кой е най-големият океан в света? ")
if answer2 == "Тихият океан" or "Тихия океан":
    print("Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'Тихият океан'")

answer3=input("Коя е най-голямата планина в света? ")
if answer3 == "Еверест":
    print("Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'Еверест'")

answer4=input("Коя е най-дългата река в света? ")
if answer4 == "Нил" :
    print("Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'Нил'")

answer5=input("Кой е най-голямата пустиня в света? ")
if answer5 == "Сахара":
    print("Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'Сахара'")

answer6=input("Коя е най-голямата държава в Южна Америка? ")
if answer6 == "Бразилия":
    print("Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'Бразилия'")

answer7=input("Кои са двата континента, които са свързани от каналите на Панама и Суец?")
if answer7 == "Северна и Южна Америка" or "Европа и Азия":
    print("Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'Северна и Южна Америка'")

answer8=input("Кои два океана са разделени от Африканския континент? ")
if answer8 == "Индийският и Атлантическият океан":
    print("Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'Индийският и Атлантическият океан'")

answer9=input("Кое е единственото място на Земята, където се срещат четири океана? ")
if answer9 == "Магелановият пролив":
    print("Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'Магелановият пролив'")

answer10=input("Кой е най - големият остров на Земята")
if answer10 == "Гренландия":
    print("Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'Гренландия'")