from  flask import Flask
answer1=input("Кога е паднал Римският император? ")
if answer1 == "476 г. след Христа":
    print("Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е '476 г. след Христа'")

answer2=input("Коя е велика французойка, която играе важна роля по време на Френската революция? ")
if answer2 == "Жана д'Арк":
    print("Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'Жана д'Арк'")

answer3=input(" Кога е завършила Първата световна война? ")
if answer3 == "1918 г.":
    print("Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е '1918 г.'")

answer4=input("Коя е годината на Великата френска революция? ")
if answer4 == "1789 г." :
    print("Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е '1789 г.'")

answer5=input("Кога започва втората световна война ")
if answer5 == "1939 г.":
    print("Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е '1939 г.'")

answer6=input("Кога започва първата световна война ")
if answer6 == "1914":
    print("Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е '1914'")

answer7=input("Къде започва Индустриалната революция")
if answer7 == "Англия":
    print("Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'Англия'")

answer8=input("Кога е освободена България? ")
if answer8 == "1878г.":
    print("Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е '1878г.'")

answer9=input("Кога България попада под Византийско робство? ")
if answer9 == "1018г.":
    print("Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е '1018г.'")

answer10=input("Кога България попада под Османско робство?")
if answer10 == "1396г.":
    print("Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е '1396г.'")