from  flask import Flask
answer1=input("Кой е основателят на западната философия? ")
if answer1 == "Сократ":
    print("Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'Сократ'")

answer2=input("Коя философска школа се асоциира с Аристотел?")
if answer2 == "Перипатетичната школа":
    print("Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'Перипатетичната школа'")

answer3=input("Кой философ е основателят на стоицизма? ")
if answer3 == "Зенон":
    print("Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'Зенон'")

answer4=input("Какъв е основният обект на изучаване в феноменологията на Хусерл? ")
if answer4 == "Феномени" :
    print("Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'Феномени'")

answer5=input("Кой философ разработва теорията за Превладаващия тип морал? ")
if answer5 == "Фридрих Ницше":
    print("Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'Фридрих Ницше'")

answer6=input("Кой философ развива теорията за когнитивна психология ")
if answer6 == "Жан Пиаже":
    print("Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'Жан Пиаже'")

answer7=input("Кой философ развива теорията за хуманистичната психология")
if answer7 == "Ейбрахам Маслоу":
    print("Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'Ейбрахам Маслоу'")

answer8=input("Кой философ развива теорията за психосоциалното развитие ")
if answer8 == "Ерик Ериксън":
    print("Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'Ерик Ериксън'")

answer9=input("Как се нарича науката, която изучава индивидуалното човешко развитие ")
if answer9 == "Психологията":
    print("Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'Психологията'")

answer10=input("Кое е първичното в пирамидата на Ейбрахам Маслоу")
if answer10 == "Физиологичните потребности":
    print("Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'Физиологичните потребности'")