from  flask import Flask
answer1=input("Как се нарича законът, който казва, че всяка действаща сила има равнопротивна сила? ")
if answer1 == "Третият закон на Нютон, или закон за действие и противодействие.":
    print("Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'Третият закон на Нютон, или закон за действие и противодействие.'")

answer2=input("Какво е уравнението, което описва отношението между енергията, масата и скоростта на частица? ")
if answer2 == "E = m*c^2":
    print("Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'E = m*c^2'")

answer3=input("Как се нарича физическата величина, която измерва количеството на вещество в обект? ")
if answer3 == "Маса":
    print("Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'Маса'")

answer4=input("Каква е формулата за сила (F), изразена чрез маса (m) и ускорение (a)? ")
if answer4 == "F = m*a" :
    print("Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'F = m*a'")

answer5=input("Как се нарича явлението, при което светлината се отклонява при преминаване през различни среди? ")
if answer5 == "Пречупване на светлината или рефракция":
    print("Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'Пречупване на светлината или рефракция'")

answer6=input("Коя физическа величина се измерва в Херци (Hz)? ")
if answer6 == "Честота":
    print("Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'Честота'")

answer7=input("Какво е уравнението за законите на Ом, което описва връзката между напрежение (V), сила на тока (I) и съпротивление (R)?")
if answer7 == "V = I*R":
    print("Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'V = I*R'")

answer8=input("Какво е пълното отражение на светлината? ")
if answer8 == "Явление, при което светлината се отразява напълно от границата между две среди":
    print("Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'Явление, при което светлината се отразява напълно от границата между две среди'")

answer9=input("Какво е дефиницията на механична енергия? ")
if answer9 == "Механичната енергия е сумата от кинетичната и потенциалната енергия на обект":
    print("Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'Механичната енергия е сумата от кинетичната и потенциалната енергия на обект'")

answer10=input("В какво се измерва мощността? ")
if answer10 == "Ват":
    print("Верен отговор!")
else:
    print(" Грешен отговор! Отговорът е 'Ват'")